package com.wangdh.mengm.bean;


import java.util.List;

public class JokeData {

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allPages":443,"ret_code":0,"contentlist":[{"text":"从前有个老强盜到外边抢回贵重东西，便放到一个朋友那儿让其代管。<br />\r\n<br />\r\n<br />\r\n后来，老强盜的体力不行了，便在江湖收手。<br />\r\n<br />\r\n<br />\r\n有一天，老强盜到朋友那儿，搬那些贵重东西。<br />\r\n<br />\r\n<br />\r\n那朋友一愣神：\u201c我说老兄，你咋这么能难为人呢？\u201d<br />\r\n<br />\r\n<br />\r\n老强盜说：\u201c我也就是来取属于我的东西，而且还付你保管费。\u201d<br />\r\n<br />\r\n<br />\r\n朋友说：\u201c你看我象当保管员的材料吗？\u201d","title":"朋友的谦虚","type":1,"ct":"2017-08-29 16:25:24.734"},{"text":"取经队伍经过一个正在闹灾荒的地区，化缘成了问题。<br />\r\n<br />\r\n<br />\r\n唐僧派八戒专职负责此事。<br />\r\n<br />\r\n<br />\r\n第一天出去，空手回来。<br />\r\n<br />\r\n<br />\r\n第二天出去，空手回来。<br />\r\n<br />\r\n<br />\r\n第三天出去，还是空手回来。<br />\r\n<br />\r\n<br />\r\n唐僧埋怨八戒：\u201c你就这点能耐啊，让大家怎么指望你？\u201d<br />\r\n<br />\r\n<br />\r\n第四天出去，这次更惨。八戒头上扎的花布手巾没了，身上披的梭布直裰没了，脚底一双鞋也没了，就穿个裤头扛着九齿钉钯回来了。<br />\r\n<br />\r\n<br />\r\n唐僧惊问：\u201c你咋造这个德性，耍流氓让人家给扒皮了？\u201d<br />\r\n<br />\r\n<br />\r\n八戒摇头叹道：\u201c别提了，跑了几个屯子，那是太困难了。吃不上喝不上不说，还都穿不上，我把能捐的都捐了。\u201d","title":"八戒化缘","type":1,"ct":"2017-08-29 16:25:24.733"},{"text":"一位老先生来到药铺，对伙计说：\u201c给我来一剂泻药。\u201d伙计把泻药递给他。　　\u201c效力快吗？\u201d老先生问道。　　\u201c特快！您看对面的茅厕，离这儿刚好五十步远，只要您现在服下药，一跑到茅厕，一定见效！\u201d　　过了一会儿，老先生愁眉苦脸地又回来了。　　伙计问：\u201c您还要一剂，老先生？\u201d　　\u201c不，我来是为了告诉你，这里离茅厕距离你少估计了两步！\u201d","title":"泻药","type":1,"ct":"2017-08-29 15:30:02.474"},{"text":"一位老人躺在床上奄奄一息，亲人们都聚拢在他身旁，老人低声说：\u201c我要告诉你们一个天大的秘密----我结婚前什么都有：有跑车、美女、许多好朋友、一大堆钱，但有个好朋友提醒我：\u2018还是结婚成家吧，否则临终的时候甚至没有人帮你倒一杯水。\u2019我听从了他的建议，不再到处玩。我将美女换成妻子，啤酒换成婴儿食品，卖掉法拉利，储存孩子的大学学费。这么一路走来，现在，你们知道我怎么想吗？\u201d　　亲人们异口同声问道：\u201c怎么想？\u201d　　老人回答：\u201c现在我是到了临终的时候，可问题是我不觉得渴呀！\u201d","title":"一个秘密","type":1,"ct":"2017-08-29 15:30:02.473"},{"text":"父亲：\u201c孩子啊！我多么希望你今后能当个大官，那我就可以享福了！\u201d　　儿子：\u201c爸爸，我多么希望你现在是个大官，那我就有靠山了！\u201d","title":"希望","type":1,"ct":"2017-08-29 15:30:02.473"},{"text":"儿子相亲回来，一脸的不高兴，母亲问他：\u201c怎么了，没看上那女孩？\u201d　　儿子嘟囔了一句：\u201c不知道。\u201d　　母亲心急地说：\u201c你看你这孩子，又没人蒙住你的眼睛，怎么会不知道呢？\u201d　　儿子极度失望地说：\u201c你不懂，这季节根本不适合相亲。\u201d　　母亲疑惑地问：\u201c为什么？\u201d　　儿子抱怨道：\u201c天太冷了，她戴着大口罩，一直没摘，我只看到了她俩眼睛。\u201d","title":"没看清","type":1,"ct":"2017-08-29 15:30:02.448"},{"text":"饭店中，一人对服务员说：\u201c这汤我没法喝。\u201d　　服务员说，不好意思，您稍等，我去找经理来。　　这人对经理说：\u201c这汤我没法喝。\u201d　　经理说，不好意思，您稍等，我去找厨师来。　　这人对厨师说：\u201c这汤我没法喝。\u201d　　厨师问：\u201c为什么呢？\u201d　　这人回答：\u201c没给我勺子。\u201d","title":"没给我勺子","type":1,"ct":"2017-08-29 15:30:02.448"},{"text":"     小学时有个女生，告诉我，暑假她爸爸带他去非洲玩了，机票要好几个亿！单纯的我还在操心，好几个亿怎么拎的动！是不是要一编织袋！小学啊！90年代初，好几个亿！我他妈居然信了！她还告诉我说，在非洲看到火山爆发了，喷出来的都是钻石！看到一个拳头大的，被一个黑人妇女抢走了！我他妈全信了啊！当然，老师说我是接班人，是国家的主人。我也信了\u2026\u2026","title":"彻悟：单纯就容易轻信","type":1,"ct":"2017-08-29 15:30:02.417"},{"title":"同事上班在玩手机，老...","text":"同事上班在玩手机，老板过来看到了说：别他妈的上班就知道玩手机，（愣了一小会儿）别一会儿又没电了。","type":1,"ct":"2017-08-29 15:27:32.427"},{"title":"跟女朋友去逛公园，她...","text":"跟女朋友去逛公园，她说想玩前面那个秋千，\r\n于是我走过去跟正在玩着的那个小朋友商量，\r\n我说：小朋友，你一个人吗？\r\n小朋友看着我点点头，\r\n于是我笑着对他说：那让给我玩，不然打死你。","type":1,"ct":"2017-08-29 15:27:32.427"},{"title":"在某餐厅听到一个土豪...","text":"在某餐厅听到一个土豪和下属对话。。。\r\n\u201c老板，喝拉菲呢，挺有品味啊！\u201d\r\n\u201c必须的嘛，我是儒商，有文化，不是土大款，这拉菲是82年的，那他妈的服务员硬说没有过期，奸商，咱们不信他，这猪蹄是刚买的，来，趁热啃一个！\u201d","type":1,"ct":"2017-08-29 14:30:10.691"},{"title":"小吴去相亲，女孩问他...","text":"小吴去相亲，女孩问他：\u201c我叫丽丽，你啥名呀？\u201d\r\n小吴说：\u201c奥，我吴边（无鞭）。\u201d女孩一听，头也不回地走了。","type":1,"ct":"2017-08-29 14:30:10.691"},{"title":"今天物理课上偷偷吃东...","text":"今天物理课上偷偷吃东西。\r\n突然老师说：\u201c服务员，给这位同学上杯水！\u201d\r\n我：\u201c\u2026\u2026\u201d\r\n","type":1,"ct":"2017-08-29 14:24:46.108"},{"text":"去网吧坐在一大排机子的末端，不大一会整排机子都停电了。玩家各种闹呀，摔鼠标的砸键盘的。网管过来看看是我把插座踢开了。他插上了也没说什么，过了一会我又踢开了，网管过来说：你走吧！要是玩游戏的知道了，我们保证不了你安全！","title":"我们保证不了你安全","type":1,"ct":"2017-08-29 14:24:46.085"},{"text":"前天跟女朋友去骑马，跑到树林里，女朋友说下马，我们俩就下马了，然后她甩了马一鞭，我追了两个小时才追回来，本来以为女朋友会夸我，结果她和我提出了分手，直到刚才下班回家路过小区门口看见两个老头下象棋才后我才恍然大悟。","title":"我追了两个小时才追回来","type":1,"ct":"2017-08-29 14:24:46.085"},{"text":"一大学正在上性教育课，给学生放岛国教育片。看到一半一男举手说上厕所，老师放他去，十分钟之后回来了。突然又一男生举手，拉起他旁边的妹子说她不舒服要背她去医务室。老师看了他一眼说，让刚刚上厕所的男生送她去吧！","title":"让刚刚上厕所的男生送她去吧","type":1,"ct":"2017-08-29 14:24:46.061"},{"title":"一位钢琴家终于成了家...","text":"一位钢琴家终于成了家，发了一大堆感言：首先要感谢父母，在我刚学钢琴时，是他们抓着我的小手，强行地往钢琴上按；\r\n第二要感谢我的钢琴老师，老师家境不好，为了挣钱，也不搞什么因材施教，把不是那块料的我活生生地修理成了那块料；\r\n第三要感谢我的邻居们，是他们多年的忍受，有的人要在耳朵里塞棉花，才带来了我今天的享受。","type":1,"ct":"2017-08-29 13:30:12.935"},{"title":"晚上去同事家，同事老...","text":"晚上去同事家，同事老婆和孩子去洗澡，这小子把我的手机带进浴室玩了，一开始没有多想，谁知道他洗完澡屁颠屁颠跑出来对着我说\u201c叔叔，叔叔，你看，这是我妈妈洗澡的样子\u201d......我真是该感谢","type":1,"ct":"2017-08-29 13:25:54.417"},{"title":"今天姥爷姨妈表妹来我...","text":"今天姥爷姨妈表妹来我家，刚刚姥爷正开心地拿着『挨拍的』来回滑~ 不小心点开了优酷~ 盯着首页说了一句『全大娘！』~ 麻麻好奇伸头一看说是『金太狼。。』~ ","type":1,"ct":"2017-08-29 13:25:54.406"},{"title":"LZ妹纸，刚去厕所（...","text":"LZ妹纸，刚去厕所（公司大楼里的公共厕所），\r\n听见外面一熊孩子冲里面喊：\u201c妈！妈！你是拉粑粑了还是尿裤了啊！太慢啦！\u201d\r\n谁知道这熊孩子妈来了句：\u201c别喊！你大姨姥姥来了！\u201d\r\n我勒个去，大姨妈都涨了一辈儿\u2026\u2026还大姨姥姥\u2026\u2026","type":1,"ct":"2017-08-29 12:30:10.738"}],"currentPage":1,"allNum":8860,"maxResult":20}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * allPages : 443
         * ret_code : 0
         * contentlist : [{"text":"从前有个老强盜到外边抢回贵重东西，便放到一个朋友那儿让其代管。<br />\r\n<br />\r\n<br />\r\n后来，老强盜的体力不行了，便在江湖收手。<br />\r\n<br />\r\n<br />\r\n有一天，老强盜到朋友那儿，搬那些贵重东西。<br />\r\n<br />\r\n<br />\r\n那朋友一愣神：\u201c我说老兄，你咋这么能难为人呢？\u201d<br />\r\n<br />\r\n<br />\r\n老强盜说：\u201c我也就是来取属于我的东西，而且还付你保管费。\u201d<br />\r\n<br />\r\n<br />\r\n朋友说：\u201c你看我象当保管员的材料吗？\u201d","title":"朋友的谦虚","type":1,"ct":"2017-08-29 16:25:24.734"},{"text":"取经队伍经过一个正在闹灾荒的地区，化缘成了问题。<br />\r\n<br />\r\n<br />\r\n唐僧派八戒专职负责此事。<br />\r\n<br />\r\n<br />\r\n第一天出去，空手回来。<br />\r\n<br />\r\n<br />\r\n第二天出去，空手回来。<br />\r\n<br />\r\n<br />\r\n第三天出去，还是空手回来。<br />\r\n<br />\r\n<br />\r\n唐僧埋怨八戒：\u201c你就这点能耐啊，让大家怎么指望你？\u201d<br />\r\n<br />\r\n<br />\r\n第四天出去，这次更惨。八戒头上扎的花布手巾没了，身上披的梭布直裰没了，脚底一双鞋也没了，就穿个裤头扛着九齿钉钯回来了。<br />\r\n<br />\r\n<br />\r\n唐僧惊问：\u201c你咋造这个德性，耍流氓让人家给扒皮了？\u201d<br />\r\n<br />\r\n<br />\r\n八戒摇头叹道：\u201c别提了，跑了几个屯子，那是太困难了。吃不上喝不上不说，还都穿不上，我把能捐的都捐了。\u201d","title":"八戒化缘","type":1,"ct":"2017-08-29 16:25:24.733"},{"text":"一位老先生来到药铺，对伙计说：\u201c给我来一剂泻药。\u201d伙计把泻药递给他。　　\u201c效力快吗？\u201d老先生问道。　　\u201c特快！您看对面的茅厕，离这儿刚好五十步远，只要您现在服下药，一跑到茅厕，一定见效！\u201d　　过了一会儿，老先生愁眉苦脸地又回来了。　　伙计问：\u201c您还要一剂，老先生？\u201d　　\u201c不，我来是为了告诉你，这里离茅厕距离你少估计了两步！\u201d","title":"泻药","type":1,"ct":"2017-08-29 15:30:02.474"},{"text":"一位老人躺在床上奄奄一息，亲人们都聚拢在他身旁，老人低声说：\u201c我要告诉你们一个天大的秘密----我结婚前什么都有：有跑车、美女、许多好朋友、一大堆钱，但有个好朋友提醒我：\u2018还是结婚成家吧，否则临终的时候甚至没有人帮你倒一杯水。\u2019我听从了他的建议，不再到处玩。我将美女换成妻子，啤酒换成婴儿食品，卖掉法拉利，储存孩子的大学学费。这么一路走来，现在，你们知道我怎么想吗？\u201d　　亲人们异口同声问道：\u201c怎么想？\u201d　　老人回答：\u201c现在我是到了临终的时候，可问题是我不觉得渴呀！\u201d","title":"一个秘密","type":1,"ct":"2017-08-29 15:30:02.473"},{"text":"父亲：\u201c孩子啊！我多么希望你今后能当个大官，那我就可以享福了！\u201d　　儿子：\u201c爸爸，我多么希望你现在是个大官，那我就有靠山了！\u201d","title":"希望","type":1,"ct":"2017-08-29 15:30:02.473"},{"text":"儿子相亲回来，一脸的不高兴，母亲问他：\u201c怎么了，没看上那女孩？\u201d　　儿子嘟囔了一句：\u201c不知道。\u201d　　母亲心急地说：\u201c你看你这孩子，又没人蒙住你的眼睛，怎么会不知道呢？\u201d　　儿子极度失望地说：\u201c你不懂，这季节根本不适合相亲。\u201d　　母亲疑惑地问：\u201c为什么？\u201d　　儿子抱怨道：\u201c天太冷了，她戴着大口罩，一直没摘，我只看到了她俩眼睛。\u201d","title":"没看清","type":1,"ct":"2017-08-29 15:30:02.448"},{"text":"饭店中，一人对服务员说：\u201c这汤我没法喝。\u201d　　服务员说，不好意思，您稍等，我去找经理来。　　这人对经理说：\u201c这汤我没法喝。\u201d　　经理说，不好意思，您稍等，我去找厨师来。　　这人对厨师说：\u201c这汤我没法喝。\u201d　　厨师问：\u201c为什么呢？\u201d　　这人回答：\u201c没给我勺子。\u201d","title":"没给我勺子","type":1,"ct":"2017-08-29 15:30:02.448"},{"text":"     小学时有个女生，告诉我，暑假她爸爸带他去非洲玩了，机票要好几个亿！单纯的我还在操心，好几个亿怎么拎的动！是不是要一编织袋！小学啊！90年代初，好几个亿！我他妈居然信了！她还告诉我说，在非洲看到火山爆发了，喷出来的都是钻石！看到一个拳头大的，被一个黑人妇女抢走了！我他妈全信了啊！当然，老师说我是接班人，是国家的主人。我也信了\u2026\u2026","title":"彻悟：单纯就容易轻信","type":1,"ct":"2017-08-29 15:30:02.417"},{"title":"同事上班在玩手机，老...","text":"同事上班在玩手机，老板过来看到了说：别他妈的上班就知道玩手机，（愣了一小会儿）别一会儿又没电了。","type":1,"ct":"2017-08-29 15:27:32.427"},{"title":"跟女朋友去逛公园，她...","text":"跟女朋友去逛公园，她说想玩前面那个秋千，\r\n于是我走过去跟正在玩着的那个小朋友商量，\r\n我说：小朋友，你一个人吗？\r\n小朋友看着我点点头，\r\n于是我笑着对他说：那让给我玩，不然打死你。","type":1,"ct":"2017-08-29 15:27:32.427"},{"title":"在某餐厅听到一个土豪...","text":"在某餐厅听到一个土豪和下属对话。。。\r\n\u201c老板，喝拉菲呢，挺有品味啊！\u201d\r\n\u201c必须的嘛，我是儒商，有文化，不是土大款，这拉菲是82年的，那他妈的服务员硬说没有过期，奸商，咱们不信他，这猪蹄是刚买的，来，趁热啃一个！\u201d","type":1,"ct":"2017-08-29 14:30:10.691"},{"title":"小吴去相亲，女孩问他...","text":"小吴去相亲，女孩问他：\u201c我叫丽丽，你啥名呀？\u201d\r\n小吴说：\u201c奥，我吴边（无鞭）。\u201d女孩一听，头也不回地走了。","type":1,"ct":"2017-08-29 14:30:10.691"},{"title":"今天物理课上偷偷吃东...","text":"今天物理课上偷偷吃东西。\r\n突然老师说：\u201c服务员，给这位同学上杯水！\u201d\r\n我：\u201c\u2026\u2026\u201d\r\n","type":1,"ct":"2017-08-29 14:24:46.108"},{"text":"去网吧坐在一大排机子的末端，不大一会整排机子都停电了。玩家各种闹呀，摔鼠标的砸键盘的。网管过来看看是我把插座踢开了。他插上了也没说什么，过了一会我又踢开了，网管过来说：你走吧！要是玩游戏的知道了，我们保证不了你安全！","title":"我们保证不了你安全","type":1,"ct":"2017-08-29 14:24:46.085"},{"text":"前天跟女朋友去骑马，跑到树林里，女朋友说下马，我们俩就下马了，然后她甩了马一鞭，我追了两个小时才追回来，本来以为女朋友会夸我，结果她和我提出了分手，直到刚才下班回家路过小区门口看见两个老头下象棋才后我才恍然大悟。","title":"我追了两个小时才追回来","type":1,"ct":"2017-08-29 14:24:46.085"},{"text":"一大学正在上性教育课，给学生放岛国教育片。看到一半一男举手说上厕所，老师放他去，十分钟之后回来了。突然又一男生举手，拉起他旁边的妹子说她不舒服要背她去医务室。老师看了他一眼说，让刚刚上厕所的男生送她去吧！","title":"让刚刚上厕所的男生送她去吧","type":1,"ct":"2017-08-29 14:24:46.061"},{"title":"一位钢琴家终于成了家...","text":"一位钢琴家终于成了家，发了一大堆感言：首先要感谢父母，在我刚学钢琴时，是他们抓着我的小手，强行地往钢琴上按；\r\n第二要感谢我的钢琴老师，老师家境不好，为了挣钱，也不搞什么因材施教，把不是那块料的我活生生地修理成了那块料；\r\n第三要感谢我的邻居们，是他们多年的忍受，有的人要在耳朵里塞棉花，才带来了我今天的享受。","type":1,"ct":"2017-08-29 13:30:12.935"},{"title":"晚上去同事家，同事老...","text":"晚上去同事家，同事老婆和孩子去洗澡，这小子把我的手机带进浴室玩了，一开始没有多想，谁知道他洗完澡屁颠屁颠跑出来对着我说\u201c叔叔，叔叔，你看，这是我妈妈洗澡的样子\u201d......我真是该感谢","type":1,"ct":"2017-08-29 13:25:54.417"},{"title":"今天姥爷姨妈表妹来我...","text":"今天姥爷姨妈表妹来我家，刚刚姥爷正开心地拿着『挨拍的』来回滑~ 不小心点开了优酷~ 盯着首页说了一句『全大娘！』~ 麻麻好奇伸头一看说是『金太狼。。』~ ","type":1,"ct":"2017-08-29 13:25:54.406"},{"title":"LZ妹纸，刚去厕所（...","text":"LZ妹纸，刚去厕所（公司大楼里的公共厕所），\r\n听见外面一熊孩子冲里面喊：\u201c妈！妈！你是拉粑粑了还是尿裤了啊！太慢啦！\u201d\r\n谁知道这熊孩子妈来了句：\u201c别喊！你大姨姥姥来了！\u201d\r\n我勒个去，大姨妈都涨了一辈儿\u2026\u2026还大姨姥姥\u2026\u2026","type":1,"ct":"2017-08-29 12:30:10.738"}]
         * currentPage : 1
         * allNum : 8860
         * maxResult : 20
         */

        private int allPages;
        private int ret_code;
        private int currentPage;
        private int allNum;
        private int maxResult;
        private List<ContentlistBean> contentlist;

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean {
            /**
             * text : 从前有个老强盜到外边抢回贵重东西，便放到一个朋友那儿让其代管。<br />
             <br />
             <br />
             后来，老强盜的体力不行了，便在江湖收手。<br />
             <br />
             <br />
             有一天，老强盜到朋友那儿，搬那些贵重东西。<br />
             <br />
             <br />
             那朋友一愣神：“我说老兄，你咋这么能难为人呢？”<br />
             <br />
             <br />
             老强盜说：“我也就是来取属于我的东西，而且还付你保管费。”<br />
             <br />
             <br />
             朋友说：“你看我象当保管员的材料吗？”
             * title : 朋友的谦虚
             * type : 1
             * ct : 2017-08-29 16:25:24.734
             */

            private String text;
            private String title;
            private int type;
            private String ct;

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }
        }
    }
}
